1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of integers (2,4,6,8,10) using Pandas module.

In [1]:
import pandas as pd
series = pd.Series([2,4,6,8,10])
series

0     2
1     4
2     6
3     8
4    10
dtype: int64

2. Write a Pandas program to add, subtract, multiple and divide two Pandas Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9].

In [7]:
import pandas as pd
series1 = pd.Series([2, 4, 6, 8, 10])
series2 = pd.Series([1, 3, 5, 7, 9])
add = series1 + series2
add
subtract = series1 - series2
subtract
multiply = series1 * series2
multiply
division = series1 / series2
division

0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

3. Write a Pandas program to compare the elements of the two Pandas Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 10].

In [10]:
import pandas as pd
series1 = pd.Series([2, 4, 6, 8, 10])
series2 = pd.Series([1, 3, 5, 7, 9])
series1 == series2
series1 > series2
series2 < series1

0    True
1    True
2    True
3    True
4    True
dtype: bool

4. Write a Pandas program to convert a NumPy array to a Pandas series.

In [12]:
import numpy as np
import pandas as pd
np_array = np.array([2, 4, 6, 8, 10])
new_series = pd.Series(np_array)
new_series

0     2
1     4
2     6
3     8
4    10
dtype: int64

5. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

Sample DataFrame: <br>
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], <br>
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], <br>
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], <br>
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} <br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [13]:
import numpy as np
import pandas as pd
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

6. Write a Pandas program to convert index of a given dataframe into a column. 
Note: not taught yet, so will you figure it out?
Test Data: <br>
<br>
   school_code class            name date_of_birth  weight <br>
t1        s001     V  Alberto Franco    15/05/2002      35 <br>
t2        s002     V    Gino Mcneill    17/05/2002      32 <br>
t3        s003    VI     Ryan Parkes    16/02/1999      33 <br>
t4        s001    VI    Eesha Hinton    25/09/1998      30 <br>
t5        s002     V    Gino Mcneill    11/05/2002      31 <br>
t6        s004    VI    David Parkes    15/09/1997      32 <br>

<b> Solution will be shown on Tuesday (22/11/2022) @ the lecture first thing </b>

In [4]:
import pandas as pd
df = pd.DataFrame({
    'school_code': ['s001', 's002', 's003', 's001', 's002', 's004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]},
    index = ['t1', 't2', 't3', 't4', 't5', 't6'])
df
print('\n Convert index of the said dataframe into a column:')
df.reset_index(level=0, inplace=True)
df

 Convert index of the said dataframe into a column:

  index school_code class            name date_of_birth  weight
0    t1        s001     V  Alberto Franco    15/05/2002      35
1    t2        s002     V    Gino Mcneill    17/05/2002      32
2    t3        s003    VI     Ryan Parkes    16/02/1999      33
3    t4        s001    VI    Eesha Hinton    25/09/1998      30
4    t5        s002     V    Gino Mcneill    11/05/2002      31
5    t6        s004    VI    David Parkes    15/09/1997      32